//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			4월 13일			(6주 2일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// STL 컨테이너 - std::string과 유사한 ZString을 만들어서 컨테이너 본질에 접근
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <fstream>
#include "ZString.h"
#include "save.h"

extern bool 관찰;			// 관찰하려면 true

//--------
int main()
//--------
{
	// [문제] "메인.cpp"에 있는 모든 단어를 ZString 객체로 읽어와라.
	// 이 문제에서 단어란 공백으로 구분된
	// 다음 문장이 문제없이 실행되도록 하자.

	std::ifstream in{ "메인.cpp" };

	if (not in) {
		std::cout << "파일 없음" << std::endl;
		return 20260413;
	}

	ZString s;
	while (in >> s) {
		std::cout << s << std::endl;
	}

	save("메인.cpp");
}
