//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			4월 13일			(6주 2일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// STL 컨테이너 - std::string과 유사한 ZString을 만들어서 컨테이너 본질에 접근
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <array>
#include "ZString.h"
#include "save.h"

extern bool 관찰;			// 관찰하려면 true

//--------
int main()
//--------
{
	std::array<ZString, 5> zs{ "333", "1", "55555", "4444", "22" };

	관찰 = true;

	for (ZString& a : zs) {			// & 안쓰면 복사생성과 소멸이 반복할 때마다 발생. & 써서 원본 출력
		std::cout << a << std::endl;
	}

	save("메인.cpp");
}
