//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			3월 10일			(2주 1일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// template
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include "save.h"

class Dog;

// 템플릿 선언문
// template -> 소스코드를 찍어내기 위한 틀
template <class 자료형, class 자료동생> // -> 이렇게 안해주면 프로그램이 죽으니까.
void change(자료형&, 자료동생&);

class Dog {
public:
	Dog() = default;
	Dog(int n) : num { n } {};
	
private:
	int num;

	friend std::ostream& operator<<(std::ostream& os, const Dog& dog) {
		return os << dog.num;
	}
};

//--------
int main() 
//--------
{
	// [문제] 의도대로 실행되게 하자. (시험문제)
	{
		Dog a{ 1 }, b{ 2 };
		change(a, b);
		std::cout << a << ", " << b << std::endl;		// 2, 1이라고 출력되어야 함
	}

	{
		int a{ 1 }, b{ 2 };
		change(a, b);
		std::cout << a << ", " << b << std::endl;		// 2, 1이라고 출력되어야 함
	}

	save("메인.cpp"); 
}

void change(Dog& p, Dog& q) {
	// std::swap(p, q);

	// 이 과정은 알고리즘 절차. -> 자료형에 무관하게 이 절차를 수행하면 swap할 수 있다.
	// 그렇다는 건 자료형이 여러개라면 이러한 함수를 여러개를 만들어야만 한다.
	// 이 활동의 자동화를 필요로 한다. 몇십년전부터.

	Dog temp{ p };
	p.operator = (q);	 // == p = q;
	q.operator = (temp); // == q = temp;
}

void change(int& p, int& q) {
	std::swap(p, q);
}