//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			6월 2일			(13주 1일)
// 6/22 기말시험(15/2) - 제일 마지막 시험
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// 
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <map>
#include <vector>
#include "save.h"
#include "ZString.h"

extern bool 관찰;			// 관찰하려면 true

//--------
int main()
//--------
{
	save("메인.cpp");

	// map - 어디에 쓸 수 있나

	// 게임회사와 히트작을 관리
	std::map<ZString, std::vector<ZString>> 회사와작품;

	//회사와작품.insert(std::pair<ZString, std::vector<ZString>>("펄어비스", { "검은 사막", "붉은 사막" }));
	회사와작품["펄어비스"] = { "검은 사막", "붉은 사막" }; 
	회사와작품["펄어비스"].push_back("보라 사막"); // value 값에(벡터) 대한 레퍼런스를 반환. -> push_back이 가능

	for (const auto& [회사, 히트작] : 회사와작품) {
		std::cout << 회사;
		for (const ZString& 게임 : 히트작) {
			std::cout << " - " << 게임;
		}
		std::cout << std::endl;
	}
}