//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			3월 23일			(3주 2일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// 많은 수의 자료를 다루기 - FILE I/O - binary I/O
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <random>
#include <fstream>
#include "save.h"

std::default_random_engine dre;
std::uniform_int_distribution uid;

//--------
int main()
//--------
{
	// [문제] 랜덤 int값 1000'0000개를 파일 "int천만개"에 저장하라.

	std::ofstream out{ "int천만개", std::ios::binary }; 
	// 기본은 text 모드이기 때문에 binary 모드로 열어야 정확히 4바이트씩 저장된다.

	// 114'826'203 - text mode로 저장
	//	40'000'000 - 메모리 그대로 저장한다면 40MB
	int num;
	for (int i = 0; i < 1000'0000; ++i) {
		num = uid(dre);
		out.write(reinterpret_cast<char*>(&num), sizeof(int));
	}

	
	save("메인.cpp");
}
