//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			3월 17일			(3주 1일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// 많은 수의 자료를 다루기 - FILE I/O
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <fstream>
#include <random>
#include "save.h"

std::default_random_engine dre;
std::uniform_int_distribution uid{ std::numeric_limits<int>::min(), std::numeric_limits<int>::max() };
// 얘도 템플릿이라서 원래는 <int> 써줘야댐

//--------
int main()
//--------
{
	// [문제] "int천만개.txt" 파일에는 int값 천만개가 저장되어있다.
	// 천만개가 있ㄷ다는 사실은 틀림없다 - 믿고 쓰자.
	// 가장 작은 값을 찾아 출력하라.
	std::ifstream ifs("int천만개.txt");
	int min = std::numeric_limits<int>::max();

	for (int i = 0; i < 1000'0000; ++i) {
		int n;
		ifs >> n;
		if (n < min) {
			min = n;
		}
	}
	std::cout << "최소값: " << min << std::endl;

	save("메인.cpp");
}
