//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			3월 30일			(4주 2일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// callable types -> 실습 -> STL
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <random>
#include <algorithm>
#include <array>
#include "save.h"

// [문제] 랜덤값을 갖는 int 1000만개를 메모리에 저장하라.
// qsort를 이용하여 오름차순 정렬하라.
// 정렬결과를 앞에서부터 1000개만 화면에 출력하라.

std::default_random_engine dre;
std::uniform_int_distribution<int> uid;

std::array<int, 1000'1000> arr;

//--------
int main()
//--------
{
	for (int i = 0; i < 1000'0000; ++i) {
		arr[i] = uid(dre);
	}

	for (int i = 0; i < 1000; ++i) {
		std::cout << arr[i] << '\n';
	}
	std::qsort(arr.data(), arr.size(), sizeof(int),
		[] (const void* a, const void* b) {
			return *(const int*)a - *(const int*)b;
		});


	save("메인.cpp");
}
