//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			3월 30일			(4주 2일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - RELEASE / X64
// VS 버전 - 17.14.27 (FEBRUARY 2026)
// 프로젝트 설정 - C++언어표준 - /STD:C++LATEST
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// CALLABLE TYPES -> 실습 -> STL
//----------------------------------------------------------------------------------------------------------------------
#INCLUDE <IOSTREAM>
#INCLUDE <FSTREAM>
#INCLUDE "SAVE.H"

// [문제] "메인.CPP"의 소문자를 모두 대문자로 바꾼 "메인대문자.CPP"를 만들어라.
//

//--------
INT MAIN()
//--------
{
	STD::IFSTREAM IN{ "메인.CPP" };
	STD::OFSTREAM OUT{ "메인대문자.CPP" };

	IF (NOT IN) {
		STD::COUT << "메인.CPP - 열 수 없습니다." << '\N';
		EXIT(0);
	}

	CHAR C;
	WHILE (IN.GET(C)) {
		OUT << STATIC_CAST<CHAR>(STD::TOUPPER(C));
	}


	SAVE("메인.CPP");
}
