//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			3월 17일			(3주 1일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// 많은 수의 자료를 다루기 - FILE I/O
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <fstream>
#include <algorithm>
#include <array>
#include "save.h"

std::array<int, 1000'0000> arr;

//--------
int main()
//--------
{
	// [문제] "int천만개.txt" 파일에는 int값 천만개가 저장되어있다.
	// 천만개가 있다는 사실은 틀림없다 - 믿고 쓰자.
	// 가장 작은 값을 찾아 출력하라.

	std::ifstream in("int천만개.txt");
	if (not in) {
		std::cout << "파일 확인해 보세요" << std::endl;
		return 2022180011;
	}

	for (int& num : arr) {
		in >> num;
	}

	std::cout << "최솟값 : " << *std::min_element(arr.begin(), arr.end()) << '\n';
	save("메인.cpp");
}
