//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			4월 13일			(6주 2일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// STL 컨테이너 - std::string과 유사한 ZString을 만들어서 컨테이너 본질에 접근
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <array>
#include <algorithm>
#include "ZString.h"
#include "save.h"

extern bool 관찰;			// 관찰하려면 true

//--------
int main()
//--------
{
	std::array<ZString, 5> zs{ "333", "1", "55555", "4444", "22" };

	//[문제] zs를 길이 오름차순으로 정렬하라. - C++11 이전 code
	// 이동생성,할당이 없으면 복사생성,할당이 일어나는데 -> 메모리 할당하는 작업부터 시작하니까 훨씬 느림.
	// 이동생성,할당을 코딩하게 되면 시스템에 메모리를 요청하는 시간 자체가 없음.
	// 포인터만 옮겨주면 되니까 훨씬 빠른 정렬이 가능하다.
	
	관찰 = true;
	
	std::sort(zs.begin(), zs.end(), [](const ZString& a, const ZString& b) { 
		return a.getLen() < b.getLen();
		});

	관찰 = false;

	for (const ZString& s : zs) {
		std::cout << s << std::endl;
	}

	save("메인.cpp");
}
