//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			3월 30일			(4주 2일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// 스마트 포인터 -> 콜러블 타입 -> 실습 -> STL
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <memory>
#include "save.h"

class Dog;

class 스마트포인터 {
public:
	스마트포인터(Dog* p) : ptr{ p } {}
	~스마트포인터() { 
		delete ptr; 
	}

private:
	Dog* ptr;
};

class Dog {
public:
	Dog() { std::cout << "생성" << std::endl; }
	~Dog() { std::cout << "소멸" << std::endl; }
};

// C++ 언어의 보증사항
// 프로그램이 정상 종료시(return 문, exit과는 다름) 스택에 생성된 지역객체를
// 반드시 소멸됨을 보장한다.
// stack-unwinding -> return 문을 만났을 때, 스택에 생성된 지역객체들을 거슬러 올라가면서 소멸시킨다. (소멸자 호출)

//--------
int main()
//--------
{
	std::unique_ptr<Dog[]>p{new Dog[10]};			// Dog* p = new Dog[10];

	save("메인.cpp");
}
