//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			4월 6일			(5주 2일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// 호출가능 타입 - callable types
// function을 사용하여 모든 호출가능 타입을 표현할 수 있다
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <array>
#include <algorithm>
#include "save.h"

bool 정렬기준(int a, int b)
{
	std::cout << "함수 ";		// 10 * log 10 (3 ~ 4)
	return a < b;
}	

//--------
int main()
//--------
{
	std::array<int, 10> a{ 8, 4, 2, 0, 1, 9, 7, 5, 6, 3 };

	//std::sort(a.begin(), a.end(), 정렬기준);
	std::sort(a.begin(), a.end(), [] (int a, int b) {		// 람다
		std::cout << "람다 ";	// 10 * log 10 (3 ~ 4)
		return a < b;
		});
	std::cout << '\n';
	
	for (int num : a) {
		std::cout << num << ' ';
	}
	std::cout << '\n';

	save("메인.cpp");
}
