//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			3월 3일			(1주 2일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// save 파일 분리
// template
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include "save.h"

void change(Dog*, Dog*);

class Dog {
public:
	Dog(int n) : num(n) {}
	void print() { std::cout << num; };

private:
	int num;
};

//--------
int main() 
//--------
{
	// [문제] 의도대로 실행되게 하자. (시험문제)
	{
		// using Dog = int;		// #define Dog int 이건 사용하면 안된다
		// Dog는 class로 작성하자.
		Dog a{ 1 }, b{ 2 };
		change(&a, &b);
		std::cout << a.print() << ", " << b.print() << std::endl;		// 2, 1이라고 출력되어야 함
	}

	{
		int a{ 1 }, b{ 2 };
		change(a, b);
		std::cout << a << ", " << b << std::endl;		// 2, 1이라고 출력되어야 함
	}
	save("메인.cpp"); 
}

void change(Dog* n1, Dog* n2) {
	std::swap(n1, n2);
}