//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			3월 17일			(3주 1일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// 많은 수의 자료를 다루기 - FILE I/O
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <fstream>
#include <random>
#include "save.h"

std::default_random_engine dre;
std::uniform_int_distribution uid{ std::numeric_limits<int>::min(), std::numeric_limits<int>::max() };
// 얘도 템플릿이라서 원래는 <int> 써줘야댐

//--------
int main()
//--------
{
	// [문제] 랜덤 int값 천만개를 다음과 같이 "int천만개.txt" 파일에 저장해였다.
	std::ofstream fout{ "int천만개.txt" };
	for (int i = 0; i < 1000'0000; ++i) {			// 119,828,581 bytes
		fout << uid(dre) << '\n';					// endl과 '\n'을 써봤을 때 endl의 속도가 느림.
													// endl은 버퍼를 강제로 비우는 기능까지 수행.
													// '\n'은 단순히 줄만 바꾸고 버퍼를 바로 비우지 않아서 속도가 훨씬 빠름.
	}

	save("메인.cpp");
}
