//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			3월 10일			(2주 1일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// template
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <string>
#include "save.h"

template <class T>

// 이건 0점코드
//T add(T p, T q)
//{
//	return p + q;
//}

T add(const T& p, const T& q)
{
	return p + q;		// p + q -> RVO(Return Value Optimization) -> 컴파일러가 최적화해서 p + q의 결과를 바로 적절한 타입의 반환값으로 만들어준다.
}

//--------
int main() 
//--------
{
	//[문제] 템플릿 함수 add를 한 개 만드르어 실행되게 하라.
	std::cout << add(1, 2) << std::endl;
	std::cout << add(std::string{ "2026년" }, std::string{ "3월 10일" }) << std::endl;
	// std::cout << add("2026년"s, "3월 10일"s) << std::endl; name space 쓰면 접미사 s써서 스트링이라고 할 수 있음
	save("메인.cpp"); 
}
