//--------------------------------------------------------------------------------------------------------------------
// 2026년 1학기 STL 월56화78			3월 10일			(2주 2일)
//--------------------------------------------------------------------------------------------------------------------
// 컴파일 환경 - Release / x64
// VS 버전 - 17.14.27 (February 2026)
// 프로젝트 설정 - C++언어표준 - /std:c++latest
//				- C/C++언어 - SDL검사 - 아니요
//---------------------------------------------------------------------------------------------------------------------
// 
//----------------------------------------------------------------------------------------------------------------------
#include <iostream>
#include <random>
#include <print>		// C++23
#include "save.h"

std::default_random_engine dre;
std::uniform_int_distribution uid{ 0, 9999 };

//--------
int main()
//--------
{
	// [문제] 랜덤값을 갖는 int 1000개를 만들어라.
	int a[1000];
	int max{0};
	for(int& num : a) {
		num = uid(dre);
		if (num > max) {
			max = num;
		}
	}
	
	for (int num : a) {
		std::print("{:8}", num);
	}
	
	// [문제] 가장 큰 값을 찾아 화면에 출력하라.
	std::print("\n가장 큰 값: {}\n", max);

	std::cout << std::endl;
	save("메인.cpp");
}
